adityaxavier/OB1203_br/OB1203RL78L13/r_iic_drv_rl78/r_iic_drv_sfr_rl78g1c.c
            /* Please add a channel as needed. */
        
        break;
    }
}


/********************************************************************************************************************
* Function Name : r_iic_drv_io_init
* Description   : Sets ports to output mode.
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_io_init(r_iic_drv_info_t *pRIic_Info)
{
    /* Channel number? */
    switch (pRIic_Info->ChNo)
    {
        case 0U:                                                /* Channel 0                                        */
#ifdef IICA0_ENABLE
            R_IIC_P_SCL0    = R_IIC_LOW;                        /* SCL0 output latch value setting to Low           */
            R_IIC_P_SDA0    = R_IIC_LOW;                        /* SDA0 output latch value setting to Low           */

            R_IIC_PM_SCL0   = R_IIC_OUT;                        /* SCL0 output mode                                 */
            R_IIC_PM_SDA0   = R_IIC_OUT;                        /* SDA0 output mode                                 */

            R_IIC_P_SCL0    = R_IIC_LOW;                        /* SCL0 output latch value setting to Low           */
            R_IIC_P_SDA0    = R_IIC_LOW;                        /* SDA0 output latch value setting to Low           */
#endif /* #ifdef IICA0_ENABLE */
        break;

        default:
        
            /* Please add a channel as needed. */
        
        break;
    }
}


/********************************************************************************************************************
* Function Name : r_iic_drv_io_chk_sda_setting
* Description   : Sets ports to input mode.
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_io_chk_sda_setting(r_iic_drv_info_t *pRIic_Info)
{
    /* Channel number? */
    switch (pRIic_Info->ChNo)
    {
        case 0U:                                                /* Channel 0                                        */
#ifdef IICA0_ENABLE
            /* SCL input mode. */
            R_IIC_PM_SCL0   = R_IIC_IN;                         /* SCL0 input mode                                  */

            /* SDA input mode. */
            R_IIC_PM_SDA0   = R_IIC_IN;                         /* SDA0 input mode                                  */
#endif /* #ifdef IICA0_ENABLE */
        break;

        default:
        
            /* Please add a channel as needed. */
        
        break;
    }
}


/********************************************************************************************************************
* Function Name : r_iic_drv_clk_low
* Description   : Sets SCL to Low.
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_clk_low(r_iic_drv_info_t *pRIic_Info)
{
    uint16_t    Cnt;
    
    /* Channel number? */
    switch (pRIic_Info->ChNo)
    {
        case 0U:                                                /* Channel 0                                        */
#ifdef IICA0_ENABLE
            R_IIC_P_SCL0    = R_IIC_LOW;                        /* SCL0 output latch setting to Low                 */
            R_IIC_PM_SCL0   = R_IIC_OUT;                        /* SCL0 output mode                                 */
            R_IIC_P_SCL0    = R_IIC_LOW;                        /* SCL0 output latch setting to Low                 */
#endif /* #ifdef IICA0_ENABLE */
        break;
        
        default:
            /* Please add a channel as needed. */
        break;
    }
    
    /* Waits for setting SCL. */
    Cnt = SCL_L_WAIT;
    do
    {
        Cnt--;
    }
    while(0 != Cnt);

    
}


/********************************************************************************************************************
* Function Name : r_iic_drv_clk_high
* Description   : Sets SCL to High.
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_clk_high(r_iic_drv_info_t *pRIic_Info)
{
    uint16_t    Cnt;

    /* Channel number? */
    switch (pRIic_Info->ChNo)
    {
        case 0U:                                                /* Channel 0                                        */
#ifdef IICA0_ENABLE
            R_IIC_PM_SCL0   = R_IIC_IN;                         /* SCL0 input mode                                  */
#endif /* #ifdef IICA0_ENABLE */
        break;

        default:
        
            /* Please add a channel as needed. */
        
        break;
    }

    /* Waits for setting SCL. */
    Cnt = SCL_H_WAIT;
    do
    {
        Cnt--;
    }
    while(0 != Cnt);

}


/********************************************************************************************************************
* Function Name : r_iic_drv_init_sfr
* Description   : IIC driver initialization
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_init_sfr(r_iic_drv_info_t *pRIic_Info)
{
    /* Creates the register pointer for the selected IICA channel. */
    volatile uint8_t * const    pcSVA       = SVA_ADR(pRIic_Info->ChNo);
    volatile uint8_t * const    pcIICCTL0   = IICCTL0_ADR(pRIic_Info->ChNo);
    volatile uint8_t * const    pcIICF      = IICF_ADR(pRIic_Info->ChNo);
    volatile uint8_t * const    pcIICCTL1   = IICCTL1_ADR(pRIic_Info->ChNo);

    /* Ports open setting. */
    r_iic_drv_io_open(pRIic_Info);                              /* Port : Input, Output latch : Low                 */

    /* Initializes IICA register. */
    *pcIICCTL0 = R_IIC_IICCTL0_RESET;                           /* IICE = 0                                         */
    
    /* Sets a transfer clock. */
    r_iic_drv_set_frequency(pRIic_Info);

    /* Sets a local address. */
    *pcSVA = R_IIC_SVA;
    
    /* Sets IICCTL1. */
    *pcIICCTL1 |= R_IIC_IICCTL1_INIT;                           /* Sets SMC, DFC and PRS.                           */

    /* Sets a start condition. */
    *pcIICF |= R_IIC_IICF_INIT;                                 /* STCEN = 1, IICRSV = 1                            */

    /* Sets IICCTL0. */
    *pcIICCTL0 |= R_IIC_IICCTL0_INIT;                           /* SPIE = 1, WTIM = 1, ACKE = 1                     */

    /* Enables IIC. */
    *pcIICCTL0 |= R_IIC_IICCTL0_ENABLE;                         /* IICE = 1                                         */

