adityaxavier/OB1203_br/OB1203RL78L13/r_iic_drv_rl78/r_iic_drv_sfr_rl78g1c.c
}


/********************************************************************************************************************
* Function Name : r_iic_drv_int_disable
* Description   : Disables interruption
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_int_disable(r_iic_drv_info_t *pRIic_Info)
{
    /* Channel number? */
    switch (pRIic_Info->ChNo)
    {
        case 0U:                                                /* Channel 0                                        */
#ifdef IICA0_ENABLE
            IICAMK0 = R_IIC_CH0_MK_DISABLE;                     /* Disables interruption.                           */
            IICAIF0 = R_IIC_CH0_IF_INIT;                        /* Clears interruption flag.                        */

            /* Sets interruption level. */
            IICAPR00 = R_IIC_CH0_PR0_INIT;
            IICAPR10 = R_IIC_CH0_PR1_INIT;
#endif /* #ifdef IICA0_ENABLE */
        break;

        default:
        
            /* Please add a channel as needed. */
        
        break;
    }
}


/********************************************************************************************************************
* Function Name : r_iic_drv_int_enable
* Description   : Enables interruption
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_int_enable(r_iic_drv_info_t *pRIic_Info)
{
    /* Channel number? */
    switch (pRIic_Info->ChNo)
    {
        case 0U:                                                /* Channel 0                                        */
#ifdef IICA0_ENABLE
            IICAIF0 = R_IIC_CH0_IF_INIT;                        /* Clears interruption flag.                        */
            IICAMK0 = R_IIC_CH0_MK_ENABLE;                      /* Enables interruption.                            */
#endif /* #ifdef IICA0_ENABLE */
        break;

        default:
        
            /* Please add a channel as needed. */
        
        break;
    }
}


/********************************************************************************************************************
* Function Name : r_iic_drv_int_maskable_disable
* Description   : Sets interruption disabled.
* Arguments     : None
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_int_maskable_disable(void)
{
    /* Sets interruption disabled. */
#ifdef __CA78K0R__
    DI();
#endif  /* __CA78K0R__ */
#ifdef __CCRL__
    __DI();
#endif  /* __CCRL__ */
#ifdef __ICCRL78__
    __disable_interrupt();
#endif  /* __ICCRL78__ */
}


/********************************************************************************************************************
* Function Name : r_iic_drv_int_maskable_enable
* Description   : Sets interruption enabled.
* Arguments     : None
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_int_maskable_enable(void)
{
    /* Sets interruption enabled. */
#ifdef __CA78K0R__
    EI();
#endif  /* __CA78K0R__ */
#ifdef __CCRL__
    __EI();
#endif  /* __CCRL__ */
#ifdef __ICCRL78__
    __enable_interrupt();
#endif  /* __ICCRL78__ */
}


/********************************************************************************************************************
* Function Name : r_iic_drv_set_frequency
* Description   : Sets IIC Frequency.
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_set_frequency(r_iic_drv_info_t *pRIic_Info)
{
    /* Creates the register pointer for the selected IICA channel. */
    volatile uint8_t * const    pcIICWL     = IICWL_ADR(pRIic_Info->ChNo);
    volatile uint8_t * const    pcIICWH     = IICWH_ADR(pRIic_Info->ChNo);

    /* Channel number? */
    switch (pRIic_Info->ChNo)
    {
        case 0U:                                                /* Channel 0                                        */
#ifdef IICA0_ENABLE
            *pcIICWL = R_IIC_CH0_LCLK;                          /* Low-level width setting                          */
            *pcIICWH = R_IIC_CH0_HCLK;                          /* High-level width setting                         */
#endif /* #ifdef IICA0_ENABLE */
        break;

        default:
        
            /* Please add a channel as needed. */
        
        break;
    }
}


/********************************************************************************************************************
* Function Name : r_iic_drv_check_sda_level
* Description   : Checks SDA level.
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : R_IIC_TRUE                        ;   SDA = High
*               : R_IIC_FALSE                       ;   SDA = Low
*********************************************************************************************************************/
bool r_iic_drv_check_sda_level(r_iic_drv_info_t *pRIic_Info)
{
    bool        Ret = R_IIC_TRUE;
    uint16_t    Cnt;

    /* Channel number? */
    switch (pRIic_Info->ChNo)
    {
        case 0U:                                                /* Channel 0                                        */
#ifdef IICA0_ENABLE

            /* Checks SDA level. */
            Cnt = SDACHK_CNT;
            do
            {
                /* SDA = High? */
                if (R_IIC_HI == R_IIC_P_SDA0)
                {
                    break;                                      /* SDA = High                                       */
                }
                Cnt--;
            }
            while(Cnt != 0);

            /* Counter limit? */
            if(0 == Cnt)
            {
                Ret = R_IIC_FALSE;                              /* SDA = Low                                        */
            }
#endif /* #ifdef IICA0_ENABLE */
        break;

        default:
        
