adityaxavier/OB1203_br/OB1203RL78L13/r_iic_drv_rl78/r_iic_drv_sfr_rl78g1c.c
/********************************************************************************************************************
* Function Name : r_iic_drv_set_sending_data
* Description   : Writes data to IICA in order to transmit.
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
*               : uint8_t *pData                    ;   Sending data buffer pointer
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_set_sending_data(r_iic_drv_info_t *pRIic_Info, uint8_t *pData)
{
    /* Creates the register pointer for the selected IICA channel. */
    volatile uint8_t * const    pcIICA      = IICA_ADR(pRIic_Info->ChNo);

    /* Sets Sending Data. */
    *pcIICA = *pData;                                           /* Writes data to IICA in order to transmit.        */

}


/********************************************************************************************************************
* Function Name : r_iic_drv_get_receiving_data
* Description   : Stores the received data from IICA to "pRIic_Info->pData buffer".
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
*               : uint8_t *pData                    ;   Sending data buffer pointer
* Return Value  : None
*********************************************************************************************************************/
uint8_t r_iic_drv_get_receiving_data(r_iic_drv_info_t *pRIic_Info)
{
    /* Creates the register pointer for the selected IICA channel. */
    volatile uint8_t * const    pcIICA      = IICA_ADR(pRIic_Info->ChNo);

    /* Stores the received data. */
    return *pcIICA;
}


/********************************************************************************************************************
* Function Name : r_iic_drv_receive_start_setting
* Description   : Setting when starts the master reception
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_receive_start_setting(r_iic_drv_info_t *pRIic_Info)
{
    /* Creates the register pointer for the selected IICA channel. */
    volatile uint8_t * const    pcIICCTL0   = IICCTL0_ADR(pRIic_Info->ChNo);
    
    /* Clears WTIM bit = 0 & Sets ACKE bit = 1. */
    *pcIICCTL0 = ((*pcIICCTL0 & R_IIC_WTIM_CLR) | R_IIC_ACKE_SET);
}


/********************************************************************************************************************
* Function Name : r_iic_drv_receive_end_setting
* Description   : Setting when stops the master reception
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_receive_end_setting(r_iic_drv_info_t *pRIic_Info)
{
    /* Creates the register pointer for the selected IICA channel. */
    volatile uint8_t * const    pcIICCTL0   = IICCTL0_ADR(pRIic_Info->ChNo);

    /* Sets WTIM bit = 1 & Clears ACKE bit = 0. */
    *pcIICCTL0 = ((*pcIICCTL0 & R_IIC_ACKE_CLR) | R_IIC_WTIM_SET);
}


/********************************************************************************************************************
* Function Name : r_iic_drv_canceling_wait
* Description   : Cancels wait.
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_canceling_wait(r_iic_drv_info_t *pRIic_Info)
{
    /* Creates the register pointer for the selected IICA channel. */
    volatile uint8_t * const    pcIICCTL0   = IICCTL0_ADR(pRIic_Info->ChNo);

    /* Cancels wait.(Starts reception.) */
    *pcIICCTL0 |= R_IIC_IICCTL0_REV;
}


/********************************************************************************************************************
* Function Name : r_iic_drv_reset_iic
* Description   : Resets iic register.
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_reset_iic(r_iic_drv_info_t *pRIic_Info)
{
    /* Creates the register pointer for the selected IICA channel. */
    volatile uint8_t * const    pcIICCTL0   = IICCTL0_ADR(pRIic_Info->ChNo);

    /* Resets IICA register. */
    *pcIICCTL0 = R_IIC_IICCTL0_RESET;
    
}


/* End of File */
